Repository: ruzanovalexei/womanlife
Catalog: lib/l10n/app_*.arb
Languages: ru

# appTitle
source: Stay in Rhythm
ru: Будь в ритме

# refreshTooltip
source: Refresh data
ru: Обновить данные

# settingsTooltip
source: Settings
ru: Настройки

# exitTooltip
source: Exit app
ru: Закрыть приложение

# errorWithMessage
source: Error: {message}
ru: Ошибка: {message}

source: Retry
ru: Повторить

# calendarNextPeriod
source: Next Period:
ru: Следующий цикл:

# calendarInDays
source: In {days} days
ru: Через {days} дн.

# calendarLegendTitle
source: Legend:
ru: Обозначения:

# calendarLegendPlanned
source: Planned
ru: Плановый

# calendarLegendActual
source: Actual
ru: Фактический

# calendarLegendToday
source: Today
ru: Сегодня

# calendarLegendOvulation
source: Ovulation
ru: День овуляции

# calendarLegendFertile
source: Fertile days
ru: Фертильные дни

# calendarLegendOverdue
source: Delay
ru: Задержка

source: Ideal time for conception
ru: Идеальное время для зачатия

source: Favorable time for conception
ru: Благополучное время для зачатия

# dayDetailsTitle
source: Day Details
ru: Детали дня

# periodManagementTitle
source: Period Management
ru: Управление периодом

# startNewPeriodButton
source: Start New Period
ru: Начать новый цикл

# startNewPeriodHint
source: Mark this day as the start of your period
ru: Отметьте этот день как начало менструации

# activePeriodLabel
source: Active period: {start} - Present
ru: Активный цикл: {start} - Текущая дата

# endPeriodButton
source: End Period Here
ru: Завершить цикл

# endPeriodHint
source: Mark this day as the end of your period
ru: Отметьте этот день как конец цикла

# cancelPeriodButton
source: Cancel Period
ru: Отменить цикл

# cancelPeriodHint
source: Remove this period record
ru: Удалить запись о цикле

# dayWithinActive
source: This day is within an active period
ru: Этот день входит в активный цикл

# dayWithinActiveHint
source: To end the period, mark the last day of bleeding
ru: Чтобы завершить цикл, отметьте последний день

# lastPeriodLabel
source: Last period: {start} - {end}
ru: Последний цикл: {start} - {end}

# lastPeriodHint
source: You can start a new period after the end date
ru: Новый цикл можно начать после даты окончания

# removeEndDateButton
source: Remove End Date
ru: Удалить дату окончания

# deletePeriodButton
source: Delete Period
ru: Удалить цикл

# deletePeriodHint
source: First remove the end date, then you can delete the entire record if needed
ru: Сначала удалите дату окончания, затем запись

# symptomsTitle
source: Symptoms
ru: Симптомы

# addSymptomHint
source: Add symptom
ru: Добавить симптом

# currentSymptomsTitle
source: Current symptoms:
ru: Текущие симптомы:

# noSymptoms
source: No symptoms added
ru: Симптомы не добавлены

# debugInfoTitle
source: Debug Info:
ru: Отладочная информация:

# debugCanMarkStart
source: Can mark start: {value}
ru: Можно отметить начало: {value}

# debugCanMarkEnd
source: Can mark end: {value}
ru: Можно отметить конец: {value}

# debugIsInActivePeriod
source: Is in active period: {value}
ru: День в активном цикле: {value}

# debugActivePeriod
source: Active period: {value}
ru: Активный цикл: {value}

# debugLastPeriod
source: Last period: {value}
ru: Последний цикл: {value}

# debugSymptomsCount
source: Symptoms count: {count}
ru: Количество симптомов: {count}

# symptomsSaved
source: Symptoms saved successfully
ru: Симптомы сохранены

# symptomsSaveError
source: Error saving symptoms: {message}
ru: Ошибка сохранения симптомов: {message}

# symptomAlreadyAddedMessage
source: Symptom already added
ru: Симптом уже добавлен

# startPeriodSuccess
source: Period started successfully
ru: Цикл начат

# startPeriodError
source: Error starting period: {message}
ru: Ошибка начала цикла: {message}

# endPeriodSuccess
source: Period ended successfully
ru: Цикл завершен

# endPeriodError
source: Error ending period: {message}
ru: Ошибка завершения цикла: {message}

# cancelPeriodSuccess
source: Period cancelled successfully
ru: Цикл отменен

# cancelPeriodError
source: Error cancelling period: {message}
ru: Ошибка отмены цикла: {message}

# removePeriodEndSuccess
source: Period end removed
ru: Дата окончания удалена

# removePeriodEndError
source: Error removing period end: {message}
ru: Ошибка удаления даты окончания: {message}

# deletePeriodSuccess
source: Period deleted
ru: Цикл удален

# deletePeriodError
source: Error deleting period: {message}
ru: Ошибка удаления цикла: {message}

# endDateBeforeStart
source: End date cannot be earlier than start date
ru: Дата окончания не может быть раньше даты начала

# settingsTitle
source: Settings
ru: Настройки

# settingsSaved
source: Settings saved successfully
ru: Настройки сохранены

# settingsSaveError
source: Error saving settings
ru: Ошибка сохранения настроек

# settingsFormCycleLength
source: Cycle Length (days)
ru: Длина цикла (дни)

# settingsFormPeriodLength
source: Period Length (days)
ru: Длительность менструации (дни)

# settingsFormPlanningMonths
source: Planning Period (months)
ru: Период планирования (мес.)

# settingsFormSaveButton
source: Save Settings
ru: Сохранить

# settingsFormValueMissing
source: Please enter a value
ru: Введите значение

# settingsFormInvalidNumber
source: Please enter a valid number
ru: Введите корректное число

# settingsFormRangeError
source: Value must be between {min} and {max}
ru: Значение должно быть от {min} до {max}

# settingsFormLanguageLabel
source: Language
ru: Язык

# settingsFormLanguageEnglish
source: English
ru: Английский

# settingsFormLanguageRussian
source: Russian
ru: Русский

# settingsFormFirstDayLabel
source: Calendar first day
ru: Первый день календаря

# settingsFormFirstDayMonday
source: Monday
ru: Понедельник

# settingsFormFirstDaySunday
source: Sunday
ru: Воскресенье

# settingsTabGeneral
source: General
ru: Основные

# settingsTabMedications
source: Medications
ru: Лекарства

# settingsTabSymptoms
source: Symptoms
ru: Симптомы

# symptomHeadache
source: Headache
ru: Головная боль

# symptomFatigue
source: Fatigue
ru: Усталость

# symptomBloating
source: Bloating
ru: Вздутие живота

# symptomIrritability
source: Irritability
ru: Раздражительность

# symptomAbdominalPain
source: Abdominal pain
ru: Боли внизу живота

# symptomAcne
source: Acne
ru: Акне

# symptomSweetCravings
source: Sweet cravings
ru: Тяга к сладкому

# symptomBreastPain
source: Breast pain
ru: Боль в груди

# symptomCramps
source: Cramps
ru: Судороги

# symptomNausea
source: Nausea
ru: Тошнота

# symptomInsomnia
source: Insomnia
ru: Бессонница

# addSymptomTitle
source: Add Symptom
ru: Добавить симптом

# editSymptomTitle
source: Edit Symptom
ru: Редактировать симптом

# symptomNameLabel
source: Symptom Name
ru: Название симптома

# symptomNameRequired
source: Enter symptom name
ru: Введите название симптома

source: Symptom added
ru: Симптом добавлен

# symptomAddError
source: Error adding symptom
ru: Ошибка добавления симптома

source: Symptom updated
ru: Симптом обновлен

# symptomUpdateError
source: Error updating symptom
ru: Ошибка обновления симптома

source: Fill all fields
ru: Заполните все поля

# deleteSymptomTitle
source: Delete Symptom
ru: Удалить симптом

# deleteSymptomMessage
source: Are you sure you want to delete symptom "{name}"?
ru: Вы уверены, что хотите удалить симптом "{name}"?

source: Symptom deleted
ru: Симптом удален

# symptomDeleteError
source: Error deleting symptom
ru: Ошибка удаления симптома

# editButton
source: Edit
ru: Редактировать

# addMedicationTitle
source: Add Medication
ru: Добавить лекарство

# editMedicationTitle
source: Edit Medication
ru: Реадктировать лекарство

# medicationNameLabel
source: Medication Name
ru: Название лекарства

# medicationStartDateLabel
source: Start Date
ru: Дата начала

# medicationPickStartDate
source: Pick start date
ru: Выберете дату начала приема

# medicationEndDateLabel
source: End Date
ru: Дата окончания

# medicationPickEndDate
source: Pick end date (optional)
ru: Выберете дату окончания приема

# cancelButton
source: Cancel
ru: Отмена

# saveButton
source: Save
ru: Сохранить

# medicationNameMissingError
source: Enter medication name and start date
ru: Введите название лекарства и даты приема

# medicationSaveError
source: Error saving medication: {message}
ru: Ошибка сохранения лекарства: {message}

# noMedications
source: No medications added
ru: Нет лекарств

# medicationEndDateNotSet
source: Not set
ru: Не заданно

# medicationTimes
source: Times
ru: Время

# medicationDeleteConfirmTitle
source: Delete Medication
ru: Удалить лекарство

# medicationDeleteConfirmMessage
source: Are you sure you want to delete "{name}"?
ru: Вы уверены, что хотите удалить "{name}"?

# deleteButton
source: Delete
ru: Удалить

# medicationDeleteSuccess
source: Medication "{name}" deleted
ru: Лекарство "{name}" удалено

# medicationDeleteError
source: Error deleting medication: {message}
ru: Ошибка удаления лекарства: {message}

# analyticsTitle
source: Analytics
ru: Аналитика

# medicationsReportTitle
source: Medications Report
ru: Отчет по приему лекарств

# medicationsReportDescription
source: Detailed analytics on medication intake, missed doses and adherence
ru: Подробная аналитика по приему лекарств, пропускам и соблюдению режима приема

source: Notification permission granted
ru: Разрешение на уведомления получено

source: Notification permission denied
ru: Разрешение на уведомления отклонено

source: Notification permission permanently denied
ru: Разрешение на уведомления навсегда отклонено

# notificationPermissionDescription
source: Required for sending medication and menstrual cycle reminders
ru: Необходимо для отправки напоминаний о лекарствах и менструальном цикле

source: Exact alarm permission granted
ru: Разрешение на точные будильники получено

source: Exact alarm permission denied
ru: Разрешение на точные будильники отклонено

source: Exact alarm permission permanently denied
ru: Разрешение на точные будильники навсегда отклонено

# exactAlarmPermissionDescription
source: Required for precise medication reminder scheduling
ru: Необходимо для точного планирования напоминаний о лекарствах

# permissionsRequestTitle
source: Permissions Required
ru: Необходимы разрешения

# permissionsRequestMessage
source: The following permissions are required for the app to work properly:
ru: Для корректной работы приложения требуются следующие разрешения:

source: Not now
ru: Не сейчас

source: Enable
ru: Включить

# openSettings
source: Settings
ru: Настройки

source: OK
ru: ОК

source: Cancel
ru: Отмена

# menuTitle
source: Menu
ru: Меню

# menuSubtitle
source: Choose the section you need
ru: Выберите нужный раздел

# menuItem1
source: Health opened
ru: Здоровье открыто

# menuItem2
source: Daily Schedule opened
ru: Распорядок дня открыт

# menuItem3
source: To-Do List opened
ru: Список дел открыт

# menuItem4
source: Habits opened
ru: Привычки открыты

# menuItem5
source: Notes opened
ru: Заметки открыты

source: Calendar
ru: Календарь
